/*
 * Есть массив имен пользователей users
 *
 * Напиши цикл, который для каждого пользователя будет выводить в консоль
 * сообщение в формате [номер элемента] - [значение элемента].
 *
 * Нумерация должна начинаться с 1. К примеру для первого элемента массива
 * с индексом 0 будет выведено '1 - Mango', а для индекса 2 выведет '3 - Ajax'
 *
 * Цикл должен выводить сообщения до тех пор, пока не закончатся элементы массива
 */

// const users = ['Mango', 'Poly', 'Ajax', 'Lux', 'Jay', 'Kong']

// for (let i = 0; i < users.length; i++) {
//   console.log(i + ' - ' + users[i])
// }

//////////////////////////////////////////////////////////////////////////

/*
 * Напиши скрипт по автоматизации оплаты процесса гравировки украшений.
 * Гравировка одного слова стоит 10 кредитов.
 */
// В переменной message хранится произвольная строка
const message = 'Proin sociis natoque et magnis parturient montes mus'
let price = 0
// Разбить строку в массив, разделитель - пробел, и записать в переменную words
console.log(words)
// Выведи в консоли длину массива words
console.log() // 8
// Используя цикл вычисли сколько будет стоить гравировка и запиши результат в переменную price
console.log(price) // 80
